//2451992 祝新豪 大数据
#include <iostream>
#include "../include/simple_menu.h"  
//#include"../common/simple_menu.cpp"
using namespace std;

int main()
{
	/* 1. 一维字符指针数组（以NULL表示结束）- 选项为数字 */
	const char* menu1[] = {
		"1.基本解",
		"2.基本解(步数记录)",
		"3.内部数组显示(横向)",
		"4.内部数组显示(纵向+横向)",
		"5.图形解-预备-画三个圆柱",
		"6.图形解-预备-在起始柱上画n个盘子",
		"7.图形解-预备-第一次移动",
		"8.图形解-自动移动版本",
		"9.图形解-游戏版",
		"0.退出",
		NULL
	};

	/* 2. 二维字符数组（以空串""表示结束）- 选项为大写字母 */
	const char menu2[][80] = {
		" A.内部数组，原样输出",
		" B.内部数组，生成提示行列并输出",
		" C.内部数组，游戏版",
		" --------------------------------------------------------",
		" D.n*n的框架(无分隔线)，原样输出",
		" E.n*n的框架(无分隔线)，含提示行列",
		" F.n*n的框架(无分隔线)，显示初始状态，鼠标移动可显示坐标",
		" G.cmd图形界面完整版(无分隔线)",
		" --------------------------------------------------------",
		" H.n*n的框架(有分隔线)，原样输出",
		" I.n*n的框架(有分隔线)，含提示行列",
		" J.n*n的框架(有分隔线)，显示初始状态，鼠标移动可显示坐标",
		" K.cmd图形界面完整版(有分隔线)",
		" --------------------------------------------------------",
		" Q.退出",
		""
	};

	/* 3. 一维字符指针（本质是单个字符串，按\n分割选项）- 选项为数字 */
	const char* menu3 = "1.基本解\n2.基本解(步数记录)\n3.内部数组显示(横向)\n4.内部数组显示(纵向+横向)\n5.图形解-预备-画三个圆柱\n6.图形解-预备-在起始柱上画n个盘子\n\
7.图形解-预备-第一次移动\n8.图形解-自动移动版本\n9.图形解-游戏版\n0.退出";


	// 测试1：一维字符指针数组菜单
	char choice1 = simple_menu(menu1, "1234657890");

	// 测试2：二维字符数组菜单
	char choice2 = simple_menu(menu2, "abcdefghijkqABC");

	// 测试3：一维字符指针菜单
	char choice3 = simple_menu(menu3, "1234567890");

	return 0;
}