// 2451317 冯久恒 计算机
#include <iostream>
#include <conio.h>
#include <Windows.h>
#include "../include/cmd_console_tools.h"
using namespace std;

/* ----------------------------------------------------------------------------------

	 本文件功能：
	1、放被 hanoi_main.cpp 调用的菜单函数，要求显示各菜单项，读入正确的选项后返回

	 本文件要求：
	1、不允许定义外部全局变量（const及#define不在限制范围内）
	2、不允许定义静态全局变量（全局变量的使用准则是：少用、慎用、能不用尽量不用）
	3、静态局部变量的数量不限制，但使用准则也是：少用、慎用、能不用尽量不用
	4、按需加入系统头文件、自定义头文件、命名空间等

   ----------------------------------------------------------------------------------- */

// 汉诺塔菜单提示词
const char* hanoi_menus[] = {
		"----------------------------------",
		"1.基本解",
		"2.基本解(步数记录)",
		"3.内部数组显示(横向)",
		"4.内部数组显示(纵向+横向)",
		"5.图形解-预备-画三个圆柱",
		"6.图形解-预备-在起始柱上画n个盘子",
		"7.图形解-预备-第一次移动",
		"8.图形解-自动移动版本",
		"9.图形解-游戏版",
		"0.退出",
		"----------------------------------",
		"[请选择:]",
		""};
// 数织菜单提示词
const char* puzzle_menus[] = {
		"---------------------------------------------------------",
		"A.内部数组，原样输出",
		"B.内部数组，生成提示行列并输出",
		"C.内部数组，游戏版",
		" --------------------------------------------------------",
		"D.n * n的框架(无分隔线)，原样输出",
		"E.n * n的框架(无分隔线)，含提示行列",
		"F.n * n的框架(无分隔线)，显示初始状态，鼠标移动可显示坐标",
		"G.cmd图形界面完整版(无分隔线)",
		" --------------------------------------------------------",
		"H.n * n的框架(有分隔线)，原样输出",
		"I.n * n的框架(有分隔线)，含提示行列",
		"J.n * n的框架(有分隔线)，显示初始状态，鼠标移动可显示坐标",
		"K.cmd图形界面完整版(有分隔线)",
		" --------------------------------------------------------",
		"Q.退出",
		"---------------------------------------------------------",
		"[请选择:]",
		""};

/***************************************************************************
  函数名称：display_menu
  功    能：显示菜单选项
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
void display_menu(const char* menus[])
{
	for (int i = 0; menus[i] != ""; i++)
	{
		cout << menus[i];
		if(menus[i+1] != "")
			cout << endl;
	}
}
/***************************************************************************
函数名称：select_op
功    能：
输入参数：
返 回 值：对应选项
说    明：
***************************************************************************/
int select_op(const char* valid_chars)
{
	while (1) 
	{
		char op = _getch();
		for (int i = 0; valid_chars[i] != '\0'; i++) 
		{
			if (op == valid_chars[i] || op == tolower(valid_chars[i])) 
			{
				//cout << op;
				return toupper(op);
			}
		}
	}
}
/***************************************************************************
函数名称：hanoi_menu
功    能：显示Hanoi对应菜单选项
输入参数：
返 回 值：对应选项
说    明：
***************************************************************************/
int hanoi_menu()
{
	cct_cls();
	cct_setfontsize("新宋体", 16, 8);
	cct_setcursor(CCT_CURSOR_VISIBLE_NORMAL);
	cct_setconsoleborder(120, 40, 120, 9001);
	display_menu(hanoi_menus);
	char op = select_op("0123456789");
	return op - '0';
}

int puzzle_menu()
{
	cct_cls();
	cct_setfontsize("新宋体", 16, 8);
	cct_setcursor(CCT_CURSOR_VISIBLE_NORMAL);
	cct_setconsoleborder(120, 40, 120, 9001);
	display_menu(puzzle_menus);
	char op = select_op("ABCDEFGHIJKQ");
	if (op == 'Q') return 0;
	return op - 'A' + 1;
}