/* 学号 姓名 班级 */
#include <iostream>
#include "18-b1.h"
using namespace std;

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：给出的是main函数的大致框架，允许进行微调或改变初值
***************************************************************************/
int main()
{
    if (1)
    {
        Circle c1(5.2);              // 半径（如果<=0，面积为0）
        Square s1(5.2);              // 边长（如果<=0，面积为0）
        Rectangle r1(5.2, 3.7);      // 长、宽（如果任一<=0，面积为0）
        Trapezoid t1(2.3, 4.4, 3.8); // 上底、下底、高（如果任一<=0，面积为0）
        Triangle t2(3, 4, 5);        // 三边长度（如果任一<=0或不构成三角形，面积为0）
        Shape *s[5] = {&c1, &s1, &r1, &t1, &t2};

        int i;
        for (i = 0; i < 5; i++)
        {
            s[i]->ShapeName();            // 分别打印不同形状图形的名称（格式参考demo）
            cout << s[i]->area() << endl; // 分别打印不同形状图形的面积（格式参考demo）
            cout << endl;
        }
    }

    if (1)
    {
        Circle c1(-1);              // 半径（如果<=0，面积为0）
        Square s1(-1);              // 边长（如果<=0，面积为0）
        Rectangle r1(5.2, -1);      // 长、宽（如果任一<=0，面积为0）
        Trapezoid t1(2.3, -1, 3.8); // 上底、下底、高（如果任一<=0，面积为0）
        Triangle t2(3, 4, -1);      // 三边长度（如果任一<=0或不构成三角形，面积为0）
        Shape *s[5] = {&c1, &s1, &r1, &t1, &t2};

        cout << "============" << endl;
        int i;
        for (i = 0; i < 5; i++)
        {
            s[i]->ShapeName();            // 分别打印不同形状图形的名称（格式参考demo）
            cout << s[i]->area() << endl; // 分别打印不同形状图形的面积（格式参考demo）
            cout << endl;
        }
    }

    return 0;
}
